src/InformationRegisters/Профосмотры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Профосмотры</Name>
			<Comment>Хранит историю проведения и планирования профосмотров</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапланированная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПрофосмотров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредварительнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправившийВрач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНаправления</Name>
					<Comment>Причина направления к врачу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПереноса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОсмотров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/РольПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РольПользователя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Управляющий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйВрач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Врач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ассистент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистратура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СестраХозяйка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдминистраторБазыДанных</Name>
					<Comment>Администратор базы данных</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОсмотров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОсмотров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Направление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОчередьНаЗапись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Профосмотр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторныйПрием</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыПрофосмотров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыПрофосмотров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланирован</Name>
					<Comment>Запланирован</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласился</Name>
					<Comment>Согласился</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НапомнитьПозже</Name>
					<Comment>Напомнить позже</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказался</Name>
					<Comment>Отказался</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/Событие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Событие</Name>
			<Comment>Предварительная запись клиента</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНапоминанияДоЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДиалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиЗаписей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеРезерва</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеренесённаяПредварительнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолисМедСтрахования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолисыМедицинскогоСтрахования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСобытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаРезерва</Name>
					<Comment>Цвет фона резерва</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакЗаблокированно</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаЗаписи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныЗаписи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/Профосмотры/Forms/ФормаСпискаПланирования/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
// Обработка создания формы на сервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокПлана.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	ЭтоЗаписьНаПрием = Ложь;
	ОтборСтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	Параметры.Свойство("ЭтоЗаписьНаПрием", ЭтоЗаписьНаПрием);
	Параметры.Свойство("Старт", Старт);
	Параметры.Свойство("Финиш", Финиш);
	Параметры.Свойство("Сотрудник", Сотрудник);	
	Параметры.Свойство("Помещение", Помещение);
	
	Если Параметры.Свойство("ТолькоВОчереди") Тогда 
		Параметры.Свойство("ТолькоВОчереди", 		ОтборВидОсмотра); 
		Параметры.Свойство("Сотрудник", 			ОтборСотрудник);
		Параметры.Свойство("ДатаЗапланированная", 	ОтборНачалоПериода);
		ОтборКоннецПериода = ТекущаяДатаСеанса();
	   	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "ВидОсмотра", ОтборВидОсмотра, ЗначениеЗаполнено(ОтборВидОсмотра), ВидСравненияКомпоновкиДанных.Равно);
	   	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "Сотрудник", ОтборСотрудник, ЗначениеЗаполнено(ОтборСотрудник), ВидСравненияКомпоновкиДанных.Равно);
	Иначе 	
		// Установка периода отбоора по умолчанию
		ОтборКоннецПериода      = ТекущаяДатаСеанса(); 
	КонецЕсли;  
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "СтруктурнаяЕдиница", ОтборСтруктурнаяЕдиница, ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница), ВидСравненияКомпоновкиДанных.Равно);

	ОтборыСписковКлиентСервер.УстановитьДиапазонДатДляСписка(СписокПлана, "ДатаЗапланированная", ОтборНачалоПериода, ВернутьКонецДняДаты(ОтборКоннецПериода), Истина);
		
	//ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "ДатаЗапланированная", ОтборКоннецПериода, ЗначениеЗаполнено(ОтборКоннецПериода), ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);	
	//ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "ДатаЗапланированная", ОтборНачалоПериода, ЗначениеЗаполнено(ОтборНачалоПериода), ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	
	Элементы.СписокТелефонКонтрагента.Видимость = НЕ (ПараметрыСеанса.ТекущийПользователь.РольПользователя = Перечисления.РольПользователя.Врач);
	
КонецПроцедуры

&НаКлиенте
// Обработчик оповещений формы
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОБНОВИТЬ_СПИСОК_ПРОФОСМОТРОВ" Тогда
		Элементы.СписокПлана.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиРеквизитовОтбора

&НаКлиенте
// Обработчик изменения отбора по дате начала периода
//
Процедура ОтборНачалоПериодаПриИзменении(Элемент)	
		
	ОтборыСписковКлиентСервер.УстановитьДиапазонДатДляСписка(СписокПлана, "ДатаЗапланированная", ОтборНачалоПериода, ВернутьКонецДняДаты(ОтборКоннецПериода), Истина);
	
	//ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "ДатаЗапланированная", ОтборНачалоПериода, ЗначениеЗаполнено(ОтборНачалоПериода),ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	
КонецПроцедуры

&НаКлиенте
// Обработчик изменения отбора по дате конца периода
//
Процедура ОтборКоннецПериодаПриИзменении(Элемент)	
		
	ОтборыСписковКлиентСервер.УстановитьДиапазонДатДляСписка(СписокПлана, "ДатаЗапланированная", ОтборНачалоПериода, ВернутьКонецДняДаты(ОтборКоннецПериода), Истина);
	
	//ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "ДатаЗапланированная", ОтборКоннецПериода, ЗначениеЗаполнено(ОтборКоннецПериода),ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	
КонецПроцедуры

&НаКлиенте
// Приизменении отбора по виду осмотра
//
Процедура ОтборВидОсмотраПриИзменении(Элемент) 
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "ВидОсмотра", ОтборВидОсмотра, ЗначениеЗаполнено(ОтборВидОсмотра),ВидСравненияКомпоновкиДанных.Равно); 
	
КонецПроцедуры

&НаКлиенте
// Обработчик изменения отбора по сотруднику
//
Процедура ОтборСотрудникПриИзменении(Элемент)	
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "Сотрудник", ОтборСотрудник, ЗначениеЗаполнено(ОтборСотрудник), ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПациентПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "Контрагент", ОтборПациент, ЗначениеЗаполнено(ОтборПациент), ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаКлиенте
// Изменения отбора по структурной единице
//
Процедура ОтборСтруктурнаяЕдиницаПриИзменении(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокПлана, "СтруктурнаяЕдиница", ОтборСтруктурнаяЕдиница, ЗначениеЗаполнено(ОтборСтруктурнаяЕдиница), ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Функция - Вернуть конец дня даты
//
Функция ВернутьКонецДняДаты(Дата)
	
	Возврат ?(ЗначениеЗаполнено(Дата), КонецДня(Дата), Дата);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСписка

&НаКлиенте
// Обработчик выбора строки в списке 
//
Процедура СписокПланаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	
	Если ЭтоЗаписьНаПрием Тогда 
		Если Элемент.ТекущиеДанные.ВидОсмотра = ПредопределенноеЗначение("Перечисление.ВидыОсмотров.ОчередьНаЗапись") Тогда 
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ДатаНачала"              , Старт);
			ПараметрыФормы.Вставить("ДатаОкончания"           , Финиш);
			ПараметрыФормы.Вставить("Контрагент"              , Элемент.ТекущиеДанные.Контрагент);
			ПараметрыФормы.Вставить("Сотрудник"               , ?(ЗначениеЗаполнено(Сотрудник), Сотрудник, Элемент.ТекущиеДанные.Сотрудник));
			ПараметрыФормы.Вставить("Помещение"               , Помещение);    
			ПараметрыФормы.Вставить("ПричинаЗаписи"           , Элемент.ТекущиеДанные.ПричинаНаправления);
			ОткрытьФорму("Документ.Событие.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);			
		КонецЕсли;
	Иначе 	
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные        = Элементы.СписокПлана.ТекущиеДанные;	
				
		ПараметрыФормы = Новый Структура; 	
		ПараметрыФормы.Вставить("Ключ", ПолучитьКлючЗаписи(ТекущиеДанные));
		
		ОткрытьФорму("РегистрСведений.Профосмотры.Форма.ФормаРедактированияЗаписиПлана", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик формы записи новго объекта
//
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ТипЗнч(НовыйОбъект.Ссылка) = Тип("ДокументСсылка.Событие") Тогда
		ЗаписьПоПланированиюОчереди(НовыйОбъект.Ссылка);
		Элементы.СписокПлана.Обновить();
		ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик начала удаления записи
//
Процедура СписокПланаПередУдалением(Элемент, Отказ)
	
	Отказ = Истина; 
	
КонецПроцедуры

&НаКлиенте
// Обработчик начала добавления записи
//
Процедура СписокПланаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа) 
	
	Отказ = Истина;  
	
КонецПроцедуры

&НаКлиенте
// Обработчик начала редактирования записи
//
Процедура СписокПланаПередНачаломИзменения(Элемент, Отказ) 
	
	Отказ = Истина;  
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Процедура, Запись по планированию очереди
//
Процедура ЗаписьПоПланированиюОчереди(СобытиеСсылка)
	
	Сотрудник = ?(СобытиеСсылка.Услуги.Количество() > 0, СобытиеСсылка.Услуги[0].Сотрудник, Справочники.Сотрудники.ПустаяСсылка());
	Если НЕ Сотрудник.Пустая() Тогда 
		НоваяЗапись = РегистрыСведений.Профосмотры.СоздатьМенеджерЗаписи();
		
		НоваяЗапись.ВидОсмотра          	= Перечисления.ВидыОсмотров.ОчередьНаЗапись;
		НоваяЗапись.Период              	= ТекущаяДата(); 
		НоваяЗапись.СтруктурнаяЕдиница  	= СобытиеСсылка.СтруктурнаяЕдиница;
		НоваяЗапись.Контрагент          	= СобытиеСсылка.Контрагент;
		НоваяЗапись.Сотрудник           	= Сотрудник;
		НоваяЗапись.АвторЗаписи         	= ПараметрыСеанса.ТекущийПользователь;
		НоваяЗапись.ДатаЗапланированная 	= СобытиеСсылка.Дата;
		НоваяЗапись.Статус              	= Перечисления.СтатусыПрофосмотров.Согласился;
		НоваяЗапись.ПредварительнаяЗапись 	= СобытиеСсылка;	
		НоваяЗапись.Записать(Ложь);	
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
// Функция - Получить ключ записи.
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьКлючЗаписи(ТекущиеДанные)
	
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("СтруктурнаяЕдиница"	, ТекущиеДанные.СтруктурнаяЕдиница);
	СтруктураОтбора.Вставить("Сотрудник"			, ТекущиеДанные.Сотрудник);
	СтруктураОтбора.Вставить("ВидОсмотра"			, ТекущиеДанные.ВидОсмотра);
	СтруктураОтбора.Вставить("Контрагент"			, ТекущиеДанные.Контрагент);
	СтруктураОтбора.Вставить("Период"				, ТекущиеДанные.Период);
	
	МассивСтруктураЗаписи = Новый Массив;
	МассивСтруктураЗаписи.Добавить(СтруктураОтбора);

	Возврат Новый("РегистрСведенийКлючЗаписи.Профосмотры", МассивСтруктураЗаписи); 
	
КОнецФункции

#КонецОбласти
